hdrckji/justintime/esp32/justintime_rfid_reader.ino
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <SPI.h>
#include <MFRC522.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ILI9341.h>
#include <time.h>

/*
  JustInTime - ESP32 RFID + ILI9341 + 2 LEDs

  Cablage recommande:
  RC522
    SDA/SS -> GPIO 5
    RST    -> GPIO 4
    SCK    -> GPIO 18
    MISO   -> GPIO 19
    MOSI   -> GPIO 23
    VCC    -> 3V3
    GND    -> GND

  ILI9341 (SPI)
    CS     -> GPIO 22
    DC     -> GPIO 21
    RES    -> GPIO 25
    SCK    -> GPIO 18
    MOSI   -> GPIO 23
    MISO   -> laisser non branche si le RC522 partage le meme SPI
    BLK    -> 3V3 (ou un GPIO si tu veux piloter le retroeclairage)
    VCC    -> 3V3
    GND    -> GND

  LEDs
    Verte  -> GPIO 26 (avec resistance 220 ohms)
    Rouge  -> GPIO 27 (avec resistance 220 ohms)

  Buzzer passif
    +      -> GPIO 33
    -      -> GND
*/

const char* WIFI_SSID = "Freebox-661B9B";
const char* WIFI_PASSWORD = "2hwtxq5brsqcswdmqdnk4m";

const char* SITE_BASE_URL = "https://diligent-embrace-production.up.railway.app";
const char* RFID_ENDPOINT = "/api/attendance/rfid";
const char* DEVICE_ID = "ESP32-RFID-01";
const char* DEVICE_LABEL = "Entree";
const char* FIRMWARE_VERSION = "jit-esp32-ili9341-3.0";

constexpr uint8_t RC522_SS_PIN = 5;
constexpr uint8_t RC522_RST_PIN = 4;
constexpr uint8_t SPI_SCK_PIN = 18;
constexpr uint8_t SPI_MISO_PIN = 19;
constexpr uint8_t SPI_MOSI_PIN = 23;

constexpr uint8_t TFT_CS_PIN = 22;
constexpr uint8_t TFT_DC_PIN = 21;
constexpr uint8_t TFT_RST_PIN = 25;   // ton RES est branche sur GPIO 25
constexpr int8_t TFT_BL_PIN = -1;     // laisse -1 si BLK est relie directement au 3V3

constexpr uint8_t GREEN_LED_PIN = 26;
constexpr uint8_t RED_LED_PIN = 27;
constexpr uint8_t BUZZER_PIN = 33;
constexpr uint8_t BUZZER_DUTY = 220;  // 0-255, plus haut = plus fort
#if !defined(ESP_ARDUINO_VERSION_MAJOR) || (ESP_ARDUINO_VERSION_MAJOR < 3)
constexpr uint8_t BUZZER_PWM_CHANNEL = 0;
#endif

const char* TZ_INFO = "CET-1CEST,M3.5.0/2,M10.5.0/3";
const char* NTP_SERVER_1 = "pool.ntp.org";
const char* NTP_SERVER_2 = "time.nist.gov";

const uint16_t COLOR_BG = ILI9341_BLACK;
const uint16_t COLOR_TEXT = ILI9341_WHITE;
const uint16_t COLOR_INFO = ILI9341_BLUE;
const uint16_t COLOR_ACCENT = ILI9341_CYAN;
const uint16_t COLOR_OK = ILI9341_GREEN;
const uint16_t COLOR_ERROR = ILI9341_RED;
const uint16_t COLOR_WARN = ILI9341_YELLOW;
const uint16_t COLOR_DIM = 0x8410;
const uint16_t COLOR_PANEL = 0x1082;
const uint16_t COLOR_OUT = 0xFD20; // orange
constexpr uint32_t TFT_SPI_FREQUENCY = 10000000;
constexpr unsigned long RFID_HEALTH_CHECK_MS = 3000;

MFRC522 mfrc522(RC522_SS_PIN, RC522_RST_PIN);
Adafruit_ILI9341 tft(TFT_CS_PIN, TFT_DC_PIN, TFT_RST_PIN);
bool displayReady = false;
bool idleScreenInitialized = false;
String lastRenderedClock = "";
String lastRenderedWifiLine = "";
String lastRenderedIdleMessage = "";
String lastRenderedSiteName = "";
bool lastRenderedWifiConnected = false;

String lastUid = "";
String idleMessage = "Passe un badge";
String siteName = "JustInTime";
unsigned long lastScanAt = 0;
unsigned long scanCooldownMs = 2000;
unsigned long lastClockRefreshAt = 0;
unsigned long clockRefreshMs = 1000;
unsigned long lastConfigSyncAt = 0;
unsigned long configRefreshMs = 300000;
unsigned long lastRfidHealthCheckAt = 0;

String clipText(const String& text, size_t maxLen) {
  if (text.length() <= maxLen) {
    return text;
  }
  if (maxLen <= 3) {
    return text.substring(0, maxLen);
  }
  return text.substring(0, maxLen - 3) + "...";
}

void deselectSpiDevices() {
  digitalWrite(RC522_SS_PIN, HIGH);
  digitalWrite(TFT_CS_PIN, HIGH);
}

void setStatusLeds(bool greenOn, bool redOn) {
  digitalWrite(GREEN_LED_PIN, greenOn ? HIGH : LOW);
  digitalWrite(RED_LED_PIN, redOn ? HIGH : LOW);
}

void updateConnectionLeds() {
  if (WiFi.status() == WL_CONNECTED) {
    setStatusLeds(false, false);
  } else {
    const bool blinkOn = ((millis() / 350) % 2) == 0;
    setStatusLeds(false, blinkOn);
  }
}

void initBuzzer() {
  pinMode(BUZZER_PIN, OUTPUT);
  digitalWrite(BUZZER_PIN, LOW);

#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcAttach(BUZZER_PIN, 2400, 8);
  ledcWrite(BUZZER_PIN, 0);
#else
  ledcSetup(BUZZER_PWM_CHANNEL, 2400, 8);
  ledcAttachPin(BUZZER_PIN, BUZZER_PWM_CHANNEL);
  ledcWrite(BUZZER_PWM_CHANNEL, 0);
#endif
}

void playBuzzerTone(uint16_t frequency, unsigned long durationMs) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcWrite(BUZZER_PIN, BUZZER_DUTY);
  ledcWriteTone(BUZZER_PIN, frequency);
#else
  ledcWrite(BUZZER_PWM_CHANNEL, BUZZER_DUTY);
  ledcWriteTone(BUZZER_PWM_CHANNEL, frequency);
#endif
  delay(durationMs);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcWriteTone(BUZZER_PIN, 0);
  ledcWrite(BUZZER_PIN, 0);
#else
  ledcWriteTone(BUZZER_PWM_CHANNEL, 0);
  ledcWrite(BUZZER_PWM_CHANNEL, 0);
#endif
}

void blinkPin(uint8_t pin, uint8_t times, unsigned long onMs, unsigned long offMs) {
  for (uint8_t i = 0; i < times; i++) {
    digitalWrite(pin, HIGH);
    delay(onMs);
    digitalWrite(pin, LOW);
    if (i + 1 < times) {
      delay(offMs);
    }
  }
  updateConnectionLeds();
}

void signalSuccess(const String& eventType = "") {
  setStatusLeds(true, false);

  if (eventType == "out") {
    playBuzzerTone(2400, 110);
    delay(25);
    playBuzzerTone(1800, 140);
    delay(20);
    playBuzzerTone(1400, 180);
  } else {
    playBuzzerTone(1400, 100);
    delay(25);
    playBuzzerTone(2000, 130);
    delay(20);
    playBuzzerTone(2600, 170);
  }

  delay(300);
  updateConnectionLeds();
}

void signalError() {
  setStatusLeds(false, true);

  playBuzzerTone(700, 180);
  delay(40);
  playBuzzerTone(520, 220);
  delay(40);
  playBuzzerTone(380, 260);

  delay(350);
  updateConnectionLeds();
}

String formatUid(const MFRC522::Uid& uid) {
  String result;

  for (byte i = 0; i < uid.size; i++) {
    if (i > 0) {
      result += "-";
    }
    if (uid.uidByte[i] < 0x10) {
      result += "0";
    }
    result += String(uid.uidByte[i], HEX);
  }

  result.toUpperCase();
  return result;
}

