hdrckji/justintime/esp32/justintime_rfid_reader.ino
String escapeJson(const String& input) {
  String output = input;
  output.replace("\\", "\\\\");
  output.replace("\"", "\\\"");
  return output;
}

String extractJsonValue(const String& body, const String& key) {
  const String needle = "\"" + key + "\"";
  const int keyPos = body.indexOf(needle);
  if (keyPos < 0) {
    return "";
  }

  const int colonPos = body.indexOf(':', keyPos + needle.length());
  if (colonPos < 0) {
    return "";
  }

  const int firstQuote = body.indexOf('"', colonPos + 1);
  if (firstQuote < 0) {
    return "";
  }

  const int secondQuote = body.indexOf('"', firstQuote + 1);
  if (secondQuote < 0) {
    return "";
  }

  return body.substring(firstQuote + 1, secondQuote);
}

long extractJsonLongValue(const String& body, const String& key, long fallbackValue) {
  const String needle = "\"" + key + "\"";
  const int keyPos = body.indexOf(needle);
  if (keyPos < 0) {
    return fallbackValue;
  }

  const int colonPos = body.indexOf(':', keyPos + needle.length());
  if (colonPos < 0) {
    return fallbackValue;
  }

  int valueStart = colonPos + 1;
  while (valueStart < body.length() && (body[valueStart] == ' ' || body[valueStart] == '\n' || body[valueStart] == '\r' || body[valueStart] == '\t')) {
    valueStart++;
  }

  int valueEnd = valueStart;
  while (valueEnd < body.length() && (isDigit(body[valueEnd]) || body[valueEnd] == '-')) {
    valueEnd++;
  }

  if (valueEnd == valueStart) {
    return fallbackValue;
  }

  return body.substring(valueStart, valueEnd).toInt();
}

String getCurrentTimeString() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 100)) {
    return "--:--:--";
  }

  char buffer[9];
  strftime(buffer, sizeof(buffer), "%H:%M:%S", &timeinfo);
  return String(buffer);
}

String formatTimestampForDisplay(const String& isoTimestamp) {
  const int timePos = isoTimestamp.indexOf('T');
  if (timePos >= 0 && isoTimestamp.length() >= timePos + 9) {
    return isoTimestamp.substring(timePos + 1, timePos + 9);
  }
  return "";
}

bool beginHttpClient(HTTPClient& http, const String& url, WiFiClientSecure& secureClient, WiFiClient& plainClient) {
  http.setReuse(false);
  http.useHTTP10(true);
  http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);

  if (url.startsWith("https://")) {
    secureClient.stop();
    secureClient.setInsecure();
    secureClient.setTimeout(15000);
    return http.begin(secureClient, url);
  }

  plainClient.stop();
  return http.begin(plainClient, url);
}

String buildApiUrl(const String& query = "") {
  String url = String(SITE_BASE_URL) + String(RFID_ENDPOINT);
  if (query.length() > 0) {
    url += query;
  }
  return url;
}

void syncClock() {
  configTzTime(TZ_INFO, NTP_SERVER_1, NTP_SERVER_2);

  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 10000)) {
    Serial.print("Heure synchronisee: ");
    Serial.println(getCurrentTimeString());
  } else {
    Serial.println("Synchronisation NTP impossible.");
  }
}

void drawCenteredText(const String& text, int y, uint8_t textSize, uint16_t color = COLOR_TEXT, uint16_t bgColor = COLOR_BG) {
  if (!displayReady || text.length() == 0) {
    return;
  }

  int16_t x1, y1;
  uint16_t w, h;
  tft.setTextSize(textSize);
  tft.getTextBounds(text, 0, 0, &x1, &y1, &w, &h);

  int x = (tft.width() - static_cast<int>(w)) / 2;
  if (x < 0) {
    x = 0;
  }

  tft.setTextColor(color, bgColor);
  tft.setCursor(x, y);
  tft.print(text);
}

void invalidateIdleScreen() {
  idleScreenInitialized = false;
  lastRenderedClock = "";
  lastRenderedWifiLine = "";
  lastRenderedIdleMessage = "";
  lastRenderedSiteName = "";
  lastRenderedWifiConnected = false;
}

void showDisplayMessage(const String& line1, const String& line2 = "", const String& line3 = "", uint16_t accentColor = COLOR_INFO) {
  if (!displayReady) {
    return;
  }

  invalidateIdleScreen();
  deselectSpiDevices();

  tft.fillScreen(COLOR_BG);
  tft.fillRect(0, 0, tft.width(), 36, accentColor);
  tft.drawFastHLine(0, 36, tft.width(), COLOR_TEXT);
  tft.fillRoundRect(12, 52, tft.width() - 24, 126, 10, COLOR_PANEL);
  tft.drawRoundRect(12, 52, tft.width() - 24, 126, 10, accentColor);

  drawCenteredText(clipText(siteName, 22), 8, 2, COLOR_TEXT, accentColor);
  drawCenteredText(clipText(line1, 22), 70, 3, COLOR_TEXT, COLOR_PANEL);
  drawCenteredText(clipText(line2, 28), 116, 2, COLOR_ACCENT, COLOR_PANEL);
  drawCenteredText(clipText(line3, 30), 150, 2, COLOR_DIM, COLOR_PANEL);
  drawCenteredText(String("Lecteur: ") + DEVICE_LABEL, 212, 1, COLOR_DIM, COLOR_BG);

  digitalWrite(TFT_CS_PIN, HIGH);
}

void initDisplay() {
  pinMode(TFT_DC_PIN, OUTPUT);
  pinMode(TFT_CS_PIN, OUTPUT);

  if (TFT_RST_PIN >= 0) {
    pinMode(TFT_RST_PIN, OUTPUT);
    digitalWrite(TFT_RST_PIN, HIGH);
    delay(5);
    digitalWrite(TFT_RST_PIN, LOW);
    delay(20);
    digitalWrite(TFT_RST_PIN, HIGH);
    delay(150);
  }

  if (TFT_BL_PIN >= 0) {
    pinMode(TFT_BL_PIN, OUTPUT);
    digitalWrite(TFT_BL_PIN, HIGH);
  }

  deselectSpiDevices();
  tft.begin(TFT_SPI_FREQUENCY);
  tft.setRotation(1); // paysage 320x240
  tft.fillScreen(COLOR_BG);
  displayReady = true;
  invalidateIdleScreen();

  showDisplayMessage("Demarrage...", "Initialisation TFT", "ILI9341 OK", COLOR_ACCENT);
}

void showIdleScreen() {
  if (!displayReady) {
    return;
  }

  const bool wifiConnected = WiFi.status() == WL_CONNECTED;
  const String currentTime = getCurrentTimeString();
  const String wifiLine = wifiConnected
    ? String("WiFi OK - ") + WiFi.localIP().toString()
    : "WiFi non connecte";

  deselectSpiDevices();

  if (!idleScreenInitialized) {
    tft.fillScreen(COLOR_BG);
    tft.fillRect(0, 0, tft.width(), 36, COLOR_INFO);
    tft.drawFastHLine(0, 36, tft.width(), COLOR_ACCENT);

    tft.fillRoundRect(18, 52, tft.width() - 36, 58, 10, COLOR_PANEL);
    tft.drawRoundRect(18, 52, tft.width() - 36, 58, 10, COLOR_ACCENT);

    tft.fillRoundRect(24, 126, tft.width() - 48, 42, 8, COLOR_PANEL);
    tft.drawRoundRect(24, 126, tft.width() - 48, 42, 8, COLOR_DIM);

    tft.fillRoundRect(18, 186, tft.width() - 36, 24, 8, COLOR_PANEL);
    tft.drawRoundRect(18, 186, tft.width() - 36, 24, 8, COLOR_DIM);

    drawCenteredText(String("Lecteur: ") + DEVICE_LABEL, 220, 1, COLOR_DIM, COLOR_BG);
    idleScreenInitialized = true;
  }

  if (lastRenderedSiteName != siteName) {
    tft.fillRect(0, 6, tft.width(), 24, COLOR_INFO);
    drawCenteredText(clipText(siteName, 22), 8, 2, COLOR_TEXT, COLOR_INFO);
    lastRenderedSiteName = siteName;
  }

  if (lastRenderedClock != currentTime) {
    tft.fillRect(26, 62, tft.width() - 52, 36, COLOR_PANEL);
    drawCenteredText(currentTime, 64, 4, COLOR_ACCENT, COLOR_PANEL);
    lastRenderedClock = currentTime;
  }

  if (lastRenderedIdleMessage != idleMessage) {
    tft.fillRect(32, 136, tft.width() - 64, 22, COLOR_PANEL);
    drawCenteredText(clipText(idleMessage, 26), 138, 2, COLOR_TEXT, COLOR_PANEL);
    lastRenderedIdleMessage = idleMessage;
  }

  if (lastRenderedWifiLine != wifiLine || lastRenderedWifiConnected != wifiConnected) {
    tft.fillRect(24, 191, tft.width() - 48, 14, COLOR_PANEL);
    drawCenteredText(clipText(wifiLine, 30), 196, 1, wifiConnected ? COLOR_OK : COLOR_ERROR, COLOR_PANEL);
    lastRenderedWifiLine = wifiLine;
    lastRenderedWifiConnected = wifiConnected;
  }

  digitalWrite(TFT_CS_PIN, HIGH);
}

