hdrckji/justintime/esp32/justintime_rfid_reader.ino
void showScanResult(const String& personName, const String& actionLine, const String& scanTime, uint16_t accentColor) {
  if (!displayReady) {
    return;
  }

  invalidateIdleScreen();
  deselectSpiDevices();

  tft.fillScreen(COLOR_BG);
  tft.fillRect(0, 0, tft.width(), 42, accentColor);
  tft.drawFastHLine(0, 42, tft.width(), COLOR_TEXT);
  tft.fillRoundRect(14, 58, tft.width() - 28, 112, 10, COLOR_PANEL);
  tft.drawRoundRect(14, 58, tft.width() - 28, 112, 10, accentColor);

  drawCenteredText(actionLine, 11, 2, COLOR_BG, accentColor);
  drawCenteredText(clipText(personName, 20), 76, 3, COLOR_TEXT, COLOR_PANEL);
  drawCenteredText(scanTime, 126, 3, COLOR_WARN, COLOR_PANEL);
  drawCenteredText("Pointage enregistre", 166, 2, COLOR_DIM, COLOR_PANEL);
  drawCenteredText(String("Lecteur: ") + DEVICE_LABEL, 212, 1, COLOR_DIM, COLOR_BG);

  digitalWrite(TFT_CS_PIN, HIGH);
}

bool isRfidReaderReady() {
  deselectSpiDevices();
  const byte version = mfrc522.PCD_ReadRegister(MFRC522::VersionReg);
  return version != 0x00 && version != 0xFF;
}

bool initRfidReader(bool showFeedback = false) {
  pinMode(RC522_RST_PIN, OUTPUT);
  digitalWrite(RC522_RST_PIN, HIGH);
  delay(5);

  deselectSpiDevices();
  mfrc522.PCD_Init();
  delay(10);
  mfrc522.PCD_AntennaOn();
  delay(5);

  deselectSpiDevices();
  const byte version = mfrc522.PCD_ReadRegister(MFRC522::VersionReg);

  Serial.print("RC522 version: 0x");
  Serial.println(version, HEX);

  const bool ready = version != 0x00 && version != 0xFF;
  if (!ready) {
    Serial.println("RC522 non detecte. Verifie SDA/SS, RST, SCK, MOSI et surtout debranche le MISO du TFT si partage SPI.");
    if (showFeedback) {
      signalError();
      showDisplayMessage("RFID indisponible", "Verifie le cablage", "debranche MISO TFT", COLOR_ERROR);
      delay(1500);
    }
  }

  return ready;
}

void connectWifi() {
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  updateConnectionLeds();
  showDisplayMessage("Connexion Wi-Fi", WIFI_SSID, "Patiente...", COLOR_INFO);

  Serial.print("Connexion Wi-Fi");
  const unsigned long wifiConnectStartedAt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - wifiConnectStartedAt < 20000) {
    updateConnectionLeds();
    delay(500);
    Serial.print(".");
  }

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println();
    Serial.println("Connexion Wi-Fi en echec (timeout).");
    updateConnectionLeds();
    showDisplayMessage("Wi-Fi indisponible", "Timeout connexion", "Nouvel essai...", COLOR_ERROR);
    return;
  }

  const String espIp = WiFi.localIP().toString();

  Serial.println();
  Serial.print("Wi-Fi connecte, IP ESP32 = ");
  Serial.println(espIp);
  Serial.print("Site cible = ");
  Serial.println(SITE_BASE_URL);

  syncClock();
  updateConnectionLeds();
  showDisplayMessage("Wi-Fi connecte", espIp, "Sync site...", COLOR_OK);
}

void syncRemoteConfig(bool showFeedback = false) {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  HTTPClient http;
  WiFiClientSecure secureClient;
  WiFiClient plainClient;
  const String url = buildApiUrl(String("?action=config&device_id=") + DEVICE_ID);

  if (!beginHttpClient(http, url, secureClient, plainClient)) {
    Serial.println("Impossible d'ouvrir la connexion HTTP pour la config.");
    return;
  }

  http.addHeader("Accept", "application/json");
  http.setTimeout(10000);

  if (showFeedback) {
    showDisplayMessage("Connexion site", "Recuperation", "configuration...", COLOR_ACCENT);
  }

  const int httpCode = http.GET();
  const String body = http.getString();

  Serial.println("==== CONFIG SITE ====");
  Serial.print("GET ");
  Serial.println(url);
  Serial.print("HTTP code: ");
  Serial.println(httpCode);
  Serial.print("Reponse  : ");
  Serial.println(body);
  Serial.println("=====================");

  if (httpCode < 0) {
    const String httpError = http.errorToString(httpCode);
    Serial.print("Erreur HTTP config: ");
    Serial.println(httpError);
    if (showFeedback) {
      signalError();
      showDisplayMessage("Config impossible", "HTTP " + String(httpCode), httpError, COLOR_ERROR);
      delay(1200);
    }
  } else if (httpCode == 200) {
    const String remoteSiteName = extractJsonValue(body, "site_name");
    const String remoteMessage = extractJsonValue(body, "display_message");
    const long remoteCooldown = extractJsonLongValue(body, "cooldown_ms", static_cast<long>(scanCooldownMs));
    const long remoteClockRefresh = extractJsonLongValue(body, "clock_refresh_ms", static_cast<long>(clockRefreshMs));
    const long remoteConfigRefresh = extractJsonLongValue(body, "config_refresh_ms", static_cast<long>(configRefreshMs));

    if (remoteSiteName.length() > 0) {
      siteName = remoteSiteName;
    }
    if (remoteMessage.length() > 0) {
      idleMessage = remoteMessage;
    }
    if (remoteCooldown >= 500 && remoteCooldown <= 15000) {
      scanCooldownMs = static_cast<unsigned long>(remoteCooldown);
    }
    if (remoteClockRefresh >= 250 && remoteClockRefresh <= 10000) {
      clockRefreshMs = static_cast<unsigned long>(remoteClockRefresh);
    }
    if (remoteConfigRefresh >= 10000) {
      configRefreshMs = static_cast<unsigned long>(remoteConfigRefresh);
    }

    lastConfigSyncAt = millis();

    if (showFeedback) {
      showDisplayMessage("Site synchronise", String(DEVICE_ID), idleMessage, COLOR_OK);
      delay(1200);
    }
  } else if (showFeedback) {
    signalError();
    showDisplayMessage("Site indisponible", "HTTP " + String(httpCode), "Mode local OK", COLOR_WARN);
    delay(1200);
  }

  http.end();
}

void sendBadge(const String& badgeId) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("Wi-Fi non connecte.");
    signalError();
    showDisplayMessage("Wi-Fi non connecte", "Reconnexion...", "Reessaie", COLOR_ERROR);
    return;
  }

  setStatusLeds(false, false);
  showDisplayMessage("Badge detecte", badgeId, "Envoi au site...", COLOR_ACCENT);

  HTTPClient http;
  WiFiClientSecure secureClient;
  WiFiClient plainClient;
  const String url = buildApiUrl();
  const String payload = String("{") +
    "\"badge_id\":\"" + escapeJson(badgeId) + "\"," +
    "\"device_id\":\"" + escapeJson(String(DEVICE_ID)) + "\"," +
    "\"device_label\":\"" + escapeJson(String(DEVICE_LABEL)) + "\"," +
    "\"firmware\":\"" + escapeJson(String(FIRMWARE_VERSION)) + "\"," +
    "\"ip\":\"" + escapeJson(WiFi.localIP().toString()) + "\"," +
    "\"rssi\":" + String(WiFi.RSSI()) +
    "}";

