hdrckji/justintime/esp32/justintime_rfid_reader.ino
  if (!beginHttpClient(http, url, secureClient, plainClient)) {
    Serial.println("Impossible d'ouvrir la connexion HTTP pour le badge.");
    signalError();
    showDisplayMessage("Erreur connexion", "HTTP init KO", "Reessaie", COLOR_ERROR);
    return;
  }

  http.addHeader("Content-Type", "application/json");
  http.addHeader("Accept", "application/json");
  http.addHeader("User-Agent", String("JustInTime-ESP32/") + FIRMWARE_VERSION);
  http.setTimeout(12000);

  const int httpCode = http.POST(payload);
  const String body = http.getString();

  if (httpCode < 0) {
    const String httpError = http.errorToString(httpCode);
    Serial.println("------------------------------");
    Serial.print("Badge lu : ");
    Serial.println(badgeId);
    Serial.print("POST URL : ");
    Serial.println(url);
    Serial.print("HTTP erreur: ");
    Serial.print(httpCode);
    Serial.print(" -> ");
    Serial.println(httpError);
    Serial.println("------------------------------");
    http.end();
    signalError();
    showDisplayMessage("Connexion site KO", "HTTP " + String(httpCode), httpError, COLOR_ERROR);
    delay(2500);
    showIdleScreen();
    lastClockRefreshAt = millis();
    return;
  }

  Serial.println("------------------------------");
  Serial.print("Badge lu : ");
  Serial.println(badgeId);
  Serial.print("POST URL : ");
  Serial.println(url);
  Serial.print("HTTP code: ");
  Serial.println(httpCode);
  Serial.print("Reponse  : ");
  Serial.println(body);
  Serial.println("------------------------------");

  String personName = extractJsonValue(body, "name");
  const String serverMessage = extractJsonValue(body, "message");
  const String errorMessage = extractJsonValue(body, "error");
  const String eventType = extractJsonValue(body, "event_type");
  const String originalEventType = extractJsonValue(body, "original_event_type");
  const bool alreadyProcessed = eventType == "duplicate" || serverMessage.indexOf("deja pris en compte") >= 0;
  String scanTime = formatTimestampForDisplay(extractJsonValue(body, "timestamp"));

  if (scanTime.length() == 0) {
    scanTime = getCurrentTimeString();
  }

  if (personName.length() == 0 && serverMessage.length() > 0) {
    const int separatorPos = serverMessage.indexOf(" enregistre");
    if (separatorPos > 0) {
      personName = serverMessage.substring(0, separatorPos);
    }
  }

  if (httpCode == 200) {
    if (alreadyProcessed) {
      const String duplicateType = originalEventType.length() > 0 ? originalEventType : "in";
      signalSuccess(duplicateType);
      showDisplayMessage(
        "Deja pointe",
        personName.length() > 0 ? personName : "Badge reconnu",
        serverMessage.length() > 0 ? serverMessage : "Pointage deja pris en compte",
        COLOR_WARN
      );
    } else {
      String actionLine = "OK";
      uint16_t actionColor = COLOR_OK;

      if (eventType == "out" || serverMessage.indexOf("sortie") >= 0) {
        actionLine = "SORTIE";
        actionColor = COLOR_OUT;
      } else if (eventType == "in" || serverMessage.indexOf("entree") >= 0) {
        actionLine = "ENTREE";
        actionColor = COLOR_OK;
      }

      signalSuccess(eventType.length() > 0 ? eventType : (actionLine == "SORTIE" ? "out" : "in"));
      showScanResult(
        personName.length() > 0 ? personName : "Badge reconnu",
        actionLine,
        scanTime,
        actionColor
      );
    }
  } else if (httpCode == 404) {
    signalError();
    showDisplayMessage("Badge inconnu", badgeId, errorMessage.length() > 0 ? errorMessage : "Ajoute-le au site", COLOR_ERROR);
  } else {
    signalError();
    showDisplayMessage("Erreur serveur", "HTTP " + String(httpCode), errorMessage.length() > 0 ? errorMessage : "Reessaie", COLOR_WARN);
  }

  http.end();
  delay(3000);
  updateConnectionLeds();
  showIdleScreen();
  lastClockRefreshAt = millis();
}

void setup() {
  Serial.begin(115200);
  delay(1000);

  pinMode(GREEN_LED_PIN, OUTPUT);
  pinMode(RED_LED_PIN, OUTPUT);
  pinMode(RC522_SS_PIN, OUTPUT);
  pinMode(RC522_RST_PIN, OUTPUT);
  pinMode(TFT_CS_PIN, OUTPUT);
  pinMode(TFT_DC_PIN, OUTPUT);

  initBuzzer();
  setStatusLeds(false, false);
  deselectSpiDevices();
  digitalWrite(RC522_RST_PIN, HIGH);

  SPI.begin(SPI_SCK_PIN, SPI_MISO_PIN, SPI_MOSI_PIN, RC522_SS_PIN);

  initDisplay();
  connectWifi();
  syncRemoteConfig(true);

  const bool rfidReady = initRfidReader(true);
  Serial.println(rfidReady ? "Lecteur RFID pret. Passe une carte devant le RC522..." : "Lecteur RFID non detecte au demarrage.");

  showIdleScreen();
  lastClockRefreshAt = millis();
  lastRfidHealthCheckAt = millis();
}

void loop() {
  updateConnectionLeds();

  if (WiFi.status() != WL_CONNECTED) {
    connectWifi();
    syncRemoteConfig(true);
  }

  if (millis() - lastConfigSyncAt >= configRefreshMs) {
    syncRemoteConfig(false);
  }

  if (millis() - lastRfidHealthCheckAt >= RFID_HEALTH_CHECK_MS) {
    lastRfidHealthCheckAt = millis();
    if (!isRfidReaderReady()) {
      Serial.println("RC522 ne repond plus, tentative de reinitialisation...");
      initRfidReader(false);
      showIdleScreen();
      lastClockRefreshAt = millis();
    }
  }

  deselectSpiDevices();

  if (!mfrc522.PICC_IsNewCardPresent()) {
    if (millis() - lastClockRefreshAt >= clockRefreshMs) {
      showIdleScreen();
      lastClockRefreshAt = millis();
    }
    delay(50);
    return;
  }

  if (!mfrc522.PICC_ReadCardSerial()) {
    delay(50);
    return;
  }

  const String uid = formatUid(mfrc522.uid);

  if (uid == lastUid && millis() - lastScanAt < scanCooldownMs) {
    mfrc522.PICC_HaltA();
    mfrc522.PCD_StopCrypto1();
    delay(250);
    return;
  }

  sendBadge(uid);
  lastUid = uid;
  lastScanAt = millis();

  mfrc522.PICC_HaltA();
  mfrc522.PCD_StopCrypto1();
  delay(300);
}
